IDENTIFICATION DIVISION.
PROGRAM-ID. CREDIT-CARD.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
FILE SECTION.
FD  CARD-FILE
    LABEL RECORDS ARE OMITTED
    BLOCK CONTAINS 0 RECORDS.
FD  MERCHANT-FILE
    LABEL RECORDS ARE OMITTED
    BLOCK CONTAINS 0 RECORDS.

WORKING-STORAGE SECTION.
01  CARD-RECORD.
    05  CARD-NUMBER PIC 9(16).
    05  CARD-HOLDER PIC X(30).
    05  BALANCE PIC 9(7)V99.
    05  CREDIT-LIMIT PIC 9(7)V99.

01  PURCHASE-AMOUNT PIC 9(7)V99.

01  MERCHANT-RECORD.
    05  MERCHANT-NAME PIC X(30).

PROCEDURE DIVISION.
OPEN INPUT CARD-FILE
READ CARD-FILE
    AT END
        DISPLAY "INVALID CARD NUMBER"
    END-READ
OPEN INPUT MERCHANT-FILE
READ MERCHANT-FILE
    AT END
        DISPLAY "INVALID MERCHANT NAME"
    END-READ
DISPLAY "Enter purchase amount: "
ACCEPT PURCHASE-AMOUNT
IF BALANCE + CREDIT-LIMIT < PURCHASE-AMOUNT
    DISPLAY "DECLINE: EXCEEDED CREDIT LIMIT"
ELSE
    ADD PURCHASE-AMOUNT TO BALANCE
    DISPLAY "APPROVED: " MERCHANT-NAME
END-IF
CLOSE CARD-FILE
CLOSE MERCHANT-FILE
STOP RUN.
